Revit 2026 API

# IndexPoint Methods

---

The IndexPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from IndexPrimitive) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

IndexPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace